Repository: zna88/flutter-id-wallet
Catalog: lib/l10n/app_*.arb
Languages: my

# homeScreenTitle
source: Home
my: ပင်မစာမျက်နှာ

# favoriteScreenTitle
source: Favorites
my: နှစ်သက်ရာများ

# settingScreenTitle
source: Settings
my: စက်တင်များ

# settingLanguageScreenTitle
source: Language
my: ဘာသာစကား

# settingLanguageDescription
source: Change to preferred application's language.
my: အက်ပလီကေးရှင်း ၏ ဘာသာစကား ပြောင်းလဲရန်။

# settingCurrentLanguage
source: Current Language
my: ယခုရွေးချယ်ထားသော ဘာသာစကား

# settingAvailableLanguages
source: Available Languages
my: ရွေးချယ်နိုင်သော ဘာသာစကားများ

# settingDarkMode
source: Dark Mode
my: အမှောင်မုတ်

# settingDarkModeDescription
source: Adjust dark mode or light mode as you want.
my: အလင်းနှင့်အမှောင်အား သင့်စိတ်ကြိုက် ချိန်ညှိရန်။

# settingApplicationListTitle
source: Application List
my: အက်ပလီကေးရှင်းများ

# settingApplicationListDescription
source: Modify list of applications.
my: အက်ပလီကေးရှင်းများအား သင့်စိတ်ကြိုက် ပြင်ရန်။

# settingApplicationListDialogTitle
source: Add Application
my: အက်ပလီကေးရှင်း ထည့်ရန်

# settingImport
source: Import
my: ဒေတာ အသွင်း

# settingImportDescription
source: Import your previously exported data.
my: သင်၏ ဒေတာများ အား စာရင်းသွင်းရန်။

# settingExport
source: Export
my: ဒေတာ အထုတ်

# settingExportDescription
source: Export your data to keep as encrypted text.
my: သင်၏ ဒေတာများ အား ထုတ်ရန်။

# settingExportDialogBtnCopy
source: Copy to Clipboard
my: ကော်ပီကူးယူမည်

# settingSecretKey
source: Secret Key
my: လျှို့၀ှက်သော့

# settingSecretKeyDescription
source: Add secret key to encrypt/decrypt your data.
my: သင်၏ ဒေတာများအား လျှို့၀ှက်သော့ဖြင့် ပိတ်/ဖွင့် ရန်။

# settingSecretKeyDialogTitle
source: Add Secret Key
my: လျှို့၀ှက်သော့ ထည့်ရန်

# settingSecretKeyDialogLabel
source: Please enter a secret key.
my: လျှို့၀ှက်သော့ကို ထည့်ပါ။

# settingPasswordTitle
source: Password
my: လျှို့၀ှက်စာသား

# settingPasswordDescription
source: Lock application with password.
my: အက်ပလီကေးရှင်းအား လျှို့၀ှက်စာသားဖြင့် ပိတ်/ဖွင့် ရန်။

# settingPasswordAdd
source: Add Password
my: လျှို့၀ှက်စာသား ထည့်ရန်

# settingPasswordAddDescription
source: It'll be asked when the application is starting up.
my: အက်ပလီကေးရှင်း အဖွင့်တွင် မေးမည့်လျှို့၀ှက်စာသားအား ထည့်ရန်။

# settingPasswordChange
source: Change Password
my: လျှို့၀ှက်စာသား ပြင်ရန်

# settingPasswordChangeDescription
source: Change your current password with new one.
my: ယခု အသုံးပြုနေဆဲဖြစ်သော လျှို့၀ှက်စာသားအား ပြောင်းလဲရန်။

# settingPasswordDelete
source: Delete Password
my: လျှို့၀ှက်စာသား ပယ်ဖျက်ရန်

# settingPasswordDeleteDescription
source: Remove password asking from start up.
my: အက်ပလီကေးရှင်း အဖွင့်တွင် လျှို့၀ှက်စာသား မေးမှုပယ်ဖျက်ရန်။

# settingPasswordAuthenticateDialogTitle
source: Authenticate
my: အတည်ပြုခြင်း

# settingPasswordAuthenticateDialogLabel
source: Please enter current password.
my: ယခု အသုံးပြုနေသော လျှို့၀ှက်စာသားကို ထည့်ပါ။

# settingAbout
source: About
my: အဘောက်

# settingAboutDescription
source: V.1.0.1
my: ဗားရှင်း ၁.၀.၁

# homeAddIdDialogTitle
source: Add ID
my: အိုင်ဒီ ထည့်ရန်

# homeEditIdDialogTitle
source: Edit ID
my: အိုင်ဒီ ပြင်ရန်

# dialogBtnAdd
source: Add
my: ထည့်မည်

# dialogBtnSave
source: Save
my: သိမ်းမည်

# dialogBtnUpdate
source: Update
my: ပြင်မည်

# dialogBtnAuthenticate
source: Authenticate
my: အတည်ပြုမည်

# dialogBtnClose
source: Close
my: ပိတ်မည်

# dialogBtnMerge
source: Merge
my: ညှိမည်

# dialogBtnOverwrite
source: Overwrite
my: အစားထိုးမည်

# dialogBtnCancel
source: Cancel
my: မလုပ်လိုပါ

# messageDeleteParam
source: {param} deleted!
my: {param} အား ပယ်ဖျက်ပြီးပြီ။

# messageNoDeleteParam
source: {param} is being used and cannot be deleted!
my: {param} သည် အသုံးပြုနေဆဲဖြစ်သောကြောင့် ပယ်ဖျက်၍ မရပါ။

# messageRemoveFavoriteParam
source: {param} removed from favorites list!
my: {param} အား နှစ်သက်ရာများမှ ထုတ်ပယ်ပြီးပြီ။

# messageUndo
source: UNDO
my: ဘွာတေး

# messageCopiedParam
source: Copied {param} to clipboard!
my: {param} ကို ကော်ပီယူပြီးပြီ။

# messageCopyParam
source: Copy {param}
my: {param} ကို ကော်ပီကူးယူမည်

# messageNoRecord
source: No records available.
my: စာရင်းမရှိသေးပါ။

# messagePasswordAdded
source: Added password!
my: လျှို့၀ှက်စာသား ထည့်ပြီးပြီ။

# messagePasswordChange
source: Changed password!
my: လျှို့၀ှက်စာသား ပြောင်းလဲပြီးပြီ။

# messagePasswordDelete
source: Deleted password!
my: လျှို့၀ှက်စာသားကို ပယ်ဖျက်ပြီးပြီ။

# messageNotAbleToDoAnyAction
source: Not able to do any action when it's locked!
my: လော့ခ်ကျနေသဖြင့် မည်သည့်လုပ်ဆောင်ချက်မှ မပြုလုပ်နိုင်ပါ။

# messageDataConflict
source: Detected data conflict! Please choose either Merge or Overwrite current data.
my: လက်ရှိ ဒေတာများအား ညှိမလား အစားထိုးမလား ရွေးချယ်ပါ။

# messageInvalidData
source: Invalid Data!
my: ဒေတာ မမှန်ကန်ပါ။

# messageMergeDone
source: Merge data process has been completed!
my: ဒေတာ ညှိခြင်း လုပ်ဆောင်ချက် ပြီးမြောက်ပြီ။

# messageOverwriteDone
source: Overwrite data process has been completed!
my: ဒေတာ အစားထိုးခြင်း လုပ်ဆောင်ချက် ပြီးမြောက်ပြီ။

# messageImportDataDone
source: Import data process has been completed!
my: ဒေတာ စာရင်းသွင်းခြင်း လုပ်ဆောင်ချက် ပြီးမြောက်ပြီ။

# validationMessageRequired
source: This field is required!
my: ဖြည့်စွက်ရန်လိုအပ်သည်။

# validationMessageFixedLengthParam
source: The fixed length should be {param}.
my: စာလုံး {param} လုံးထည့်ရန် လိုအပ်သည်။

# validationMessageMinLengthParam
source: The length should be at least {param}.
my: စာလုံး အနည်းဆုံး {param} လုံးထည့်ရန် လိုအပ်သည်။

# validationMessagePasswordNotMatched
source: Password values are not matched!
my: လျှို့၀ှက်စာသားများ မတူညီပါ။

# validationMessageInvalidPassword
source: Invalid password!
my: လျှို့၀ှက်စာသား မှားယွင်းနေပါသည်။

# labelId
source: ID
my: အိုင်ဒီ

# labelPassword
source: Password
my: လျှို့၀ှက်စာသား

# labelData
source: Export Data
my: ဒေတာ

# labelAllId
source: ALL IDs
my: အိုင်ဒီ အားလုံး

# labelSelectOne
source: SELECT ONE
my: တစ်ခုရွေးပါ

# labelLockedTitle
source: Locked!
my: လော့ခ်ကျနေသည်။

# labelLockedDescription
source: Not able to decrypt data, please make sure whether secret key you're using is correct.
my: လျှို့၀ှက်သော့ မှားယွင်းနေပါသဖြင့် အိုင်ဒီကို မဖော်ပြနိုင်ပါ။

# hintTextSecretKey
source: Secret Key..
my: လျှို့၀ှက်သော့..

# hintTextAppName
source: Application Name..
my: အက်ပလီကေးရှင်း နာမည်..

# hintTextId
source: ID..
my: အိုင်ဒီ..

# hintTextPassword
source: Password..
my: လျှို့၀ှက်စာသား..

# hintTextConfirmPassword
source: Confirm Password..
my: အတည်ပြု လျှို့၀ှက်စာသား..

# hintTextCurrentPassword
source: Current Password..
my: လက်ရှိ လျှို့၀ှက်စာသား..

# hintTextImportData
source: Please paste encrypted data here..
my: ဤနေရာတွင် လျှို့၀ှက်ထားသော ဒေတာ ကို ကော်ပီကူးထည့်ပါ..
